backend/app/Http/Controllers/EmployeeController.php

select * from `employees`
---
    public function index(Request $request)
    {
        //
        $employees = Employee::all();

select * from `employees` where `empNumber` like '%3　38147%' or `id` like '%3　38147%' or `lastName` like '%3　38147%' or `firstName` like '%3　38147%'
---
    public function search(Request $request)
    {
        $search = $request->input('search');
        $employees = Employee::query()
                ->when($search, function ($q) use ($search) {
                    $q->where('empNumber', 'like', "%{$search}%")
                        ->orWhere('id', 'like', "%{$search}%")
                        ->orWhere('lastName', 'like', "%{$search}%")
                        ->orWhere('firstName', 'like', "%{$search}%");
                })->get();